feniex/firm_F1-TestFixture/F1-TestFixture.cydsn/Generated_Source/PSoC5/MUX_CTRL_460800.h
/*******************************************************************************
* File Name: MUX_CTRL_460800.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_MUX_CTRL_460800_H) /* CY_CONTROL_REG_MUX_CTRL_460800_H */
#define CY_CONTROL_REG_MUX_CTRL_460800_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} MUX_CTRL_460800_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    MUX_CTRL_460800_Write(uint8 control) ;
uint8   MUX_CTRL_460800_Read(void) ;

void MUX_CTRL_460800_SaveConfig(void) ;
void MUX_CTRL_460800_RestoreConfig(void) ;
void MUX_CTRL_460800_Sleep(void) ; 
void MUX_CTRL_460800_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define MUX_CTRL_460800_Control        (* (reg8 *) MUX_CTRL_460800_Sync_ctrl_reg__CONTROL_REG )
#define MUX_CTRL_460800_Control_PTR    (  (reg8 *) MUX_CTRL_460800_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_MUX_CTRL_460800_H */


/* [] END OF FILE */
